import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        //Задача 3
        //Реализовать функцию перевода числа в строковое представление, без использования встроенных функции
        // языка программирования,
        // если такие есть в явном виде (Например, для 1С без использования функции ЧислоПрописью).

        //Пример: 1020 - > «Одна тысяча двадцать».

        //Число целое положительное или ноль.

        //Не больше 100 000 000, но программа должна ЛЕГКО расширяться для добавления больших чисел. Это очень важное условие.

        String[][] sex = {
                {"", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"},
                {"", "одна", "две", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"}};
        String[] str100 = {"", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот",
                "девятьсот"};
        String[] str11 = {"", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
                "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать", "двадцать"};
        String[] str10 = {"", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят",
                "восемьдесят", "девяносто"};
        String[][] forms = {
                {"", "", ""},
                {"тысяча", "тысячи", "тысяч"},
                {"миллион", "миллиона", "миллионов"},
                {"миллиард", "миллиарда", "миллиардов"}, //1 ++++++++++
                {"триллион", "триллиона", "триллионов"}  //2 +++++++++++
                };

        Scanner sc = new Scanner(System.in);
        while (true) {
            //System.out.println("Введите число от 0 до 100_000_000:");
            System.out.println("Введите число от 0 до 100_000_000_000_000:"); //  3 ---------
            //int number = sc.nextInt();
            long number = sc.nextLong(); // 4 ----------
            //проверка что пользователь ввел число из диапазона от 0 до 100_000_000
            if (number < 0 && number > 100_000_000_000_000L) { //  5 -----------
            //if (number < 0 && number > 100_000_000) {
                System.out.println("Число вне лимита.");
                break;
            }
            // вводим необходимые нам переменные
            String str = "";
            if (number == 0) str = "ноль";
            int gender;
            int z = 0;
            //Разбиваем введенное пользователем число на сегменты по 3 символа
            //int[] segment = new int[3];
            int[] segment = new int[5]; //  6------------
            for (int i = segment.length - 1; i >= 0; i--) {
               // int x = number % 1000;
                long x = number % 1000; //  7----------
                number /= 1000;
                segment[i] = (int) x;
            }
            //Перебираем сегменты
            for (int i = 0; i < segment.length; i++) {
                //Условие для определение рода
                if (i == segment.length - 2) gender = 1;
                else gender = 0;
                // Разбиваем сегмент на цифры
                int n = segment[i];
                int one = n / 100;
                int two = n % 100 / 10;
                int three = n % 10;
                int twoAndThree = n % 100;
                //Переводим число в строковое представление
                //Условие для сотен
                if (n > 99 && twoAndThree ==0) {
                    z = 2;
                    str += str100[one] + " "+ forms[(segment.length - 1) - i][z] + " ";
                }else{
                    str += str100[one] + " ";
                }
                //Условие для десятых
                if (twoAndThree > 20) {
                    if (three > 5) z = 2;
                    if (three > 1 && three < 5) z = 1;
                    if (three == 1) z = 0;
                    if (three == 0) z = 2;
                    str += str10[two] + " ";
                    str += sex[gender][three] + " " + forms[(segment.length - 1) - i][z] + " ";
                } else if (twoAndThree > 0 && twoAndThree <= 20) {
                    if (twoAndThree > 9) {
                        if (twoAndThree > 10 && twoAndThree < 20) z = 2;
                        if (three == 0) z = 2;
                        str += str11[twoAndThree - 9] + " " + forms[(segment.length - 1) - i][z] + " "; // 10-20
                    } else {
                        if (three > 5) z = 2;
                        if (three > 1 && three < 5) z = 1;
                        if (three == 1) z = 0;
                        str += sex[gender][three] + " " + forms[(segment.length - 1) - i][z] + " "; // 0-9
                    }
                }
            }
            System.out.println(str);
        }
    }
}
// Чтобы расширить программу для больших чисел в моем конкретном случае нужно добавить 2 и поменять 5 строчек